/*!
 * @file    joyconlib_rumble.c
 * @brief   Joy-Conライブラリ 振動関係
 * @author  K. Morita
 * @remarks
 * The following resources/projects were referenced for this library:
 *  https://github.com/dekuNukem/Nintendo_Switch_Reverse_Engineering
 *  https://github.com/CTCaer/jc_toolkit
 *
 * Copyright (c) 2022 K. Morita, All Rights Reserved.
 * this library is released under the MIT license.
 */
#include "joyconlib_types.h"
#include <stdbool.h>
#include <stdlib.h>
#include <unistd.h>

// Frequency Table
joycon_freq_t joycon_freq_table[] = {
    // HF Byte 0-1 #	LF Byte 2 #	Frequency (Hz)	Frequency Rounded (Hz)
    { 0, 0, 0, 0, 0 }, // dummy non-use
    { 0, 0, 0x01, 40.875885, 41 },
    { 0, 0, 0x02, 41.77095, 42 },
    { 0, 0, 0x03, 42.685616, 43 },
    { 0, 0, 0x04, 43.620308, 44 },
    { 0, 0, 0x05, 44.57547, 45 },
    { 0, 0, 0x06, 45.551544, 46 },
    { 0, 0, 0x07, 46.548996, 47 },
    { 0, 0, 0x08, 47.568283, 48 },
    { 0, 0, 0x09, 48.609894, 49 },
    { 0, 0, 0x0A, 49.674313, 50 },
    { 0, 0, 0x0B, 50.762039, 51 },
    { 0, 0, 0x0C, 51.873581, 52 },
    { 0, 0, 0x0D, 53.009464, 53 },
    { 0, 0, 0x0E, 54.170223, 54 },
    { 0, 0, 0x0F, 55.356396, 55 },
    { 0, 0, 0x10, 56.568542, 57 },
    { 0, 0, 0x11, 57.807232, 58 },
    { 0, 0, 0x12, 59.073048, 59 },
    { 0, 0, 0x13, 60.366577, 60 },
    { 0, 0, 0x14, 61.688435, 62 },
    { 0, 0, 0x15, 63.039234, 63 },
    { 0, 0, 0x16, 64.419617, 64 },
    { 0, 0, 0x17, 65.830215, 66 },
    { 0, 0, 0x18, 67.271713, 67 },
    { 0, 0, 0x19, 68.744774, 69 },
    { 0, 0, 0x1A, 70.250084, 70 },
    { 0, 0, 0x1B, 71.788361, 72 },
    { 0, 0, 0x1C, 73.360321, 73 },
    { 0, 0, 0x1D, 74.966705, 75 },
    { 0, 0, 0x1e, 76.608261, 77 },
    { 0, 0, 0x1f, 78.285767, 78 },
    { 0, 0, 0x20, 80, 80 },
    { 0x04, 0x00, 0x21, 81.75177, 82 },
    { 0x08, 0x00, 0x22, 83.541901, 84 },
    { 0x0c, 0x00, 0x23, 85.371231, 85 },
    { 0x10, 0x00, 0x24, 87.240616, 87 },
    { 0x14, 0x00, 0x25, 89.15094, 89 },
    { 0x18, 0x00, 0x26, 91.103088, 91 },
    { 0x1c, 0x00, 0x27, 93.097992, 93 },
    { 0x20, 0x00, 0x28, 95.136566, 95 },
    { 0x24, 0x00, 0x29, 97.219788, 97 },
    { 0x28, 0x00, 0x2a, 99.348625, 99 },
    { 0x2c, 0x00, 0x2b, 101.524078, 102 },
    { 0x30, 0x00, 0x2c, 103.747162, 104 },
    { 0x34, 0x00, 0x2d, 106.018929, 106 },
    { 0x38, 0x00, 0x2e, 108.340446, 108 },
    { 0x3c, 0x00, 0x2f, 110.712791, 111 },
    { 0x40, 0x00, 0x30, 113.137085, 113 },
    { 0x44, 0x00, 0x31, 115.614464, 116 },
    { 0x48, 0x00, 0x32, 118.146095, 118 },
    { 0x4c, 0x00, 0x33, 120.733154, 121 },
    { 0x50, 0x00, 0x34, 123.376869, 123 },
    { 0x54, 0x00, 0x35, 126.078468, 126 },
    { 0x58, 0x00, 0x36, 128.839233, 129 },
    { 0x5c, 0x00, 0x37, 131.660431, 132 },
    { 0x60, 0x00, 0x38, 134.543427, 135 },
    { 0x64, 0x00, 0x39, 137.489548, 137 },
    { 0x68, 0x00, 0x3a, 140.500168, 141 },
    { 0x6c, 0x00, 0x3b, 143.576721, 144 },
    { 0x70, 0x00, 0x3c, 146.720642, 147 },
    { 0x74, 0x00, 0x3d, 149.933411, 150 },
    { 0x78, 0x00, 0x3e, 153.216522, 153 },
    { 0x7c, 0x00, 0x3f, 156.571533, 157 },
    { 0x80, 0x00, 0x40, 160, 160 },
    { 0x84, 0x00, 0x41, 163.50354, 164 },
    { 0x88, 0x00, 0x42, 167.083801, 167 },
    { 0x8c, 0x00, 0x43, 170.742462, 171 },
    { 0x90, 0x00, 0x44, 174.481232, 174 },
    { 0x94, 0x00, 0x45, 178.30188, 178 },
    { 0x98, 0x00, 0x46, 182.206177, 182 },
    { 0x9c, 0x00, 0x47, 186.195984, 186 },
    { 0xa0, 0x00, 0x48, 190.273132, 190 },
    { 0xa4, 0x00, 0x49, 194.439575, 194 },
    { 0xa8, 0x00, 0x4a, 198.69725, 199 },
    { 0xac, 0x00, 0x4b, 203.048157, 203 },
    { 0xb0, 0x00, 0x4c, 207.494324, 207 },
    { 0xb4, 0x00, 0x4d, 212.037857, 212 },
    { 0xb8, 0x00, 0x4e, 216.680893, 217 },
    { 0xbc, 0x00, 0x4f, 221.425583, 221 },
    { 0xc0, 0x00, 0x50, 226.27417, 226 },
    { 0xc4, 0x00, 0x51, 231.228928, 231 },
    { 0xc8, 0x00, 0x52, 236.292191, 236 },
    { 0xcc, 0x00, 0x53, 241.466309, 241 },
    { 0xd0, 0x00, 0x54, 246.753738, 247 },
    { 0xd4, 0x00, 0x55, 252.156937, 252 },
    { 0xd8, 0x00, 0x56, 257.678467, 258 },
    { 0xdc, 0x00, 0x57, 263.320862, 263 },
    { 0xe0, 0x00, 0x58, 269.086853, 269 },
    { 0xe4, 0x00, 0x59, 274.979095, 275 },
    { 0xe8, 0x00, 0x5a, 281.000336, 281 },
    { 0xec, 0x00, 0x5b, 287.153442, 287 },
    { 0xf0, 0x00, 0x5c, 293.441284, 293 },
    { 0xf4, 0x00, 0x5d, 299.866821, 300 },
    { 0xf8, 0x00, 0x5e, 306.433044, 306 },
    { 0xfc, 0x00, 0x5f, 313.143066, 313 },
    { 0x00, 0x01, 0x60, 320, 320 },
    { 0x04, 0x01, 0x61, 327.00708, 327 },
    { 0x08, 0x01, 0x62, 334.167603, 334 },
    { 0x0c, 0x01, 0x63, 341.484924, 341 },
    { 0x10, 0x01, 0x64, 348.962463, 349 },
    { 0x14, 0x01, 0x65, 356.60376, 357 },
    { 0x18, 0x01, 0x66, 364.412354, 364 },
    { 0x1c, 0x01, 0x67, 372.391968, 372 },
    { 0x20, 0x01, 0x68, 380.546265, 381 },
    { 0x24, 0x01, 0x69, 388.87915, 389 },
    { 0x28, 0x01, 0x6a, 397.394501, 397 },
    { 0x2c, 0x01, 0x6b, 406.096313, 406 },
    { 0x30, 0x01, 0x6c, 414.988647, 415 },
    { 0x34, 0x01, 0x6d, 424.075714, 424 },
    { 0x38, 0x01, 0x6e, 433.361786, 433 },
    { 0x3c, 0x01, 0x6f, 442.851166, 443 },
    { 0x40, 0x01, 0x70, 452.54834, 453 },
    { 0x44, 0x01, 0x71, 462.457855, 462 },
    { 0x48, 0x01, 0x72, 472.584381, 473 },
    { 0x4c, 0x01, 0x73, 482.932617, 483 },
    { 0x50, 0x01, 0x74, 493.507477, 494 },
    { 0x54, 0x01, 0x75, 504.313873, 504 },
    { 0x58, 0x01, 0x76, 515.356934, 515 },
    { 0x5c, 0x01, 0x77, 526.641724, 527 },
    { 0x60, 0x01, 0x78, 538.173706, 538 },
    { 0x64, 0x01, 0x79, 549.958191, 550 },
    { 0x68, 0x01, 0x7a, 562.000671, 562 },
    { 0x6c, 0x01, 0x7b, 574.306885, 574 },
    { 0x70, 0x01, 0x7c, 586.882568, 587 },
    { 0x74, 0x01, 0x7d, 599.733643, 600 },
    { 0x78, 0x01, 0x7e, 612.866089, 613 },
    { 0x7c, 0x01, 0x7f, 626.286133, 626 },
    { 0x80, 0x01, 0, 640, 640 },
    { 0x84, 0x01, 0, 654.01416, 654 },
    { 0x88, 0x01, 0, 668.335205, 668 },
    { 0x8c, 0x01, 0, 682.969849, 683 },
    { 0x90, 0x01, 0, 697.924927, 698 },
    { 0x94, 0x01, 0, 713.20752, 713 },
    { 0x98, 0x01, 0, 728.824707, 729 },
    { 0x9c, 0x01, 0, 744.783936, 745 },
    { 0xa0, 0x01, 0, 761.092529, 761 },
    { 0xa4, 0x01, 0, 777.758301, 778 },
    { 0xa8, 0x01, 0, 794.789001, 795 },
    { 0xac, 0x01, 0, 812.192627, 812 },
    { 0xb0, 0x01, 0, 829.977295, 830 },
    { 0xb4, 0x01, 0, 848.151428, 848 },
    { 0xb8, 0x01, 0, 866.723572, 867 },
    { 0xbc, 0x01, 0, 885.702332, 886 },
    { 0xc0, 0x01, 0, 905.09668, 905 },
    { 0xc4, 0x01, 0, 924.91571, 925 },
    { 0xc8, 0x01, 0, 945.168762, 945 },
    { 0xcc, 0x01, 0, 965.865234, 966 },
    { 0xd0, 0x01, 0, 987.014954, 987 },
    { 0xd4, 0x01, 0, 1008.627747, 1009 },
    { 0xd8, 0x01, 0, 1030.713867, 1031 },
    { 0xdc, 0x01, 0, 1053.283447, 1053 },
    { 0xe0, 0x01, 0, 1076.347412, 1076 },
    { 0xe4, 0x01, 0, 1099.916382, 1100 },
    { 0xe8, 0x01, 0, 1124.001343, 1124 },
    { 0xec, 0x01, 0, 1148.61377, 1149 },
    { 0xf0, 0x01, 0, 1173.765137, 1174 },
    { 0xf4, 0x01, 0, 1199.467285, 1199 },
    { 0xf8, 0x01, 0, 1225.732178, 1226 },
    { 0xfc, 0x01, 0, 1252.572266, 1253 }
};

// Amplitude Table
joycon_amp_t joycon_amp_table[] = {
    // HA Byte 1 #	LA Byte 2-3 #	Amplitude	Amplitude Rounded
    { 0x00, 0x00, 0x40, 0.000000, 0.000 },
    { 0x02, 0x80, 0x40, 0.007843, 0.010 },
    { 0x04, 0x00, 0x41, 0.011823, 0.012 },
    { 0x06, 0x80, 0x41, 0.014061, 0.014 },
    { 0x08, 0x00, 0x42, 0.016720, 0.017 },
    { 0x0a, 0x80, 0x42, 0.019885, 0.020 },
    { 0x0c, 0x00, 0x43, 0.023648, 0.024 },
    { 0x0e, 0x80, 0x43, 0.028123, 0.028 },
    { 0x10, 0x00, 0x44, 0.033442, 0.033 },
    { 0x12, 0x80, 0x44, 0.039771, 0.040 },
    { 0x14, 0x00, 0x45, 0.047296, 0.047 },
    { 0x16, 0x80, 0x45, 0.056246, 0.056 },
    { 0x18, 0x00, 0x46, 0.066886, 0.067 },
    { 0x1a, 0x80, 0x46, 0.079542, 0.080 },
    { 0x1c, 0x00, 0x47, 0.094592, 0.095 },
    { 0x1e, 0x80, 0x47, 0.112491, 0.112 },
    { 0x20, 0x00, 0x48, 0.117471, 0.117 },
    { 0x22, 0x80, 0x48, 0.122671, 0.123 },
    { 0x24, 0x00, 0x49, 0.128102, 0.128 },
    { 0x26, 0x80, 0x49, 0.133774, 0.134 },
    { 0x28, 0x00, 0x4a, 0.139697, 0.140 },
    { 0x2a, 0x80, 0x4a, 0.145882, 0.146 },
    { 0x2c, 0x00, 0x4b, 0.152341, 0.152 },
    { 0x2e, 0x80, 0x4b, 0.159085, 0.159 },
    { 0x30, 0x00, 0x4c, 0.166129, 0.166 },
    { 0x32, 0x80, 0x4c, 0.173484, 0.173 },
    { 0x34, 0x00, 0x4d, 0.181166, 0.181 },
    { 0x36, 0x80, 0x4d, 0.189185, 0.189 },
    { 0x38, 0x00, 0x4e, 0.197561, 0.198 },
    { 0x3a, 0x80, 0x4e, 0.206308, 0.206 },
    { 0x3c, 0x00, 0x4f, 0.215442, 0.215 },
    { 0x3e, 0x80, 0x4f, 0.224982, 0.225 },
    { 0x40, 0x00, 0x50, 0.229908, 0.230 },
    { 0x42, 0x80, 0x50, 0.234943, 0.235 },
    { 0x44, 0x00, 0x51, 0.240087, 0.240 },
    { 0x46, 0x80, 0x51, 0.245345, 0.245 },
    { 0x48, 0x00, 0x52, 0.250715, 0.251 },
    { 0x4a, 0x80, 0x52, 0.256206, 0.256 },
    { 0x4c, 0x00, 0x53, 0.261816, 0.262 },
    { 0x4e, 0x80, 0x53, 0.267549, 0.268 },
    { 0x50, 0x00, 0x54, 0.273407, 0.273 },
    { 0x52, 0x80, 0x54, 0.279394, 0.279 },
    { 0x54, 0x00, 0x55, 0.285514, 0.286 },
    { 0x56, 0x80, 0x55, 0.291765, 0.292 },
    { 0x58, 0x00, 0x56, 0.298154, 0.298 },
    { 0x5a, 0x80, 0x56, 0.304681, 0.305 },
    { 0x5c, 0x00, 0x57, 0.311353, 0.311 },
    { 0x5e, 0x80, 0x57, 0.318171, 0.318 },
    { 0x60, 0x00, 0x58, 0.325138, 0.325 },
    { 0x62, 0x80, 0x58, 0.332258, 0.332 },
    { 0x64, 0x00, 0x59, 0.339534, 0.340 },
    { 0x66, 0x80, 0x59, 0.346969, 0.347 },
    { 0x68, 0x00, 0x5a, 0.354566, 0.355 },
    { 0x6a, 0x80, 0x5a, 0.362331, 0.362 },
    { 0x6c, 0x00, 0x5b, 0.370265, 0.370 },
    { 0x6e, 0x80, 0x5b, 0.378372, 0.378 },
    { 0x70, 0x00, 0x5c, 0.386657, 0.387 },
    { 0x72, 0x80, 0x5c, 0.395124, 0.395 },
    { 0x74, 0x00, 0x5d, 0.403777, 0.404 },
    { 0x76, 0x80, 0x5d, 0.412619, 0.413 },
    { 0x78, 0x00, 0x5e, 0.421652, 0.422 },
    { 0x7a, 0x80, 0x5e, 0.430885, 0.431 },
    { 0x7c, 0x00, 0x5f, 0.440321, 0.440 },
    { 0x7e, 0x80, 0x5f, 0.449964, 0.450 },
    { 0x80, 0x00, 0x60, 0.459817, 0.460 },
    { 0x82, 0x80, 0x60, 0.469885, 0.470 },
    { 0x84, 0x00, 0x61, 0.480174, 0.480 },
    { 0x86, 0x80, 0x61, 0.490689, 0.491 },
    { 0x88, 0x00, 0x62, 0.501433, 0.501 },
    { 0x8a, 0x80, 0x62, 0.512413, 0.512 },
    { 0x8c, 0x00, 0x63, 0.523633, 0.524 },
    { 0x8e, 0x80, 0x63, 0.535100, 0.535 },
    { 0x90, 0x00, 0x64, 0.546816, 0.547 },
    { 0x92, 0x80, 0x64, 0.558790, 0.559 },
    { 0x94, 0x00, 0x65, 0.571027, 0.571 },
    { 0x96, 0x80, 0x65, 0.583530, 0.584 },
    { 0x98, 0x00, 0x66, 0.596307, 0.596 },
    { 0x9a, 0x80, 0x66, 0.609365, 0.609 },
    { 0x9c, 0x00, 0x67, 0.622708, 0.623 },
    { 0x9e, 0x80, 0x67, 0.636344, 0.636 },
    { 0xa0, 0x00, 0x68, 0.650279, 0.650 },
    { 0xa2, 0x80, 0x68, 0.664518, 0.665 },
    { 0xa4, 0x00, 0x69, 0.679069, 0.679 },
    { 0xa6, 0x80, 0x69, 0.693939, 0.694 },
    { 0xa8, 0x00, 0x6a, 0.709133, 0.709 },
    { 0xaa, 0x80, 0x6a, 0.724662, 0.725 },
    { 0xac, 0x00, 0x6b, 0.740529, 0.741 },
    { 0xae, 0x80, 0x6b, 0.756745, 0.757 },
    { 0xb0, 0x00, 0x6c, 0.773316, 0.773 },
    { 0xb2, 0x80, 0x6c, 0.790249, 0.790 },
    { 0xb4, 0x00, 0x6d, 0.807554, 0.808 },
    { 0xb6, 0x80, 0x6d, 0.825237, 0.825 },
    { 0xb8, 0x00, 0x6e, 0.843307, 0.843 },
    { 0xba, 0x80, 0x6e, 0.861772, 0.862 },
    { 0xbc, 0x00, 0x6f, 0.880643, 0.881 },
    { 0xbe, 0x80, 0x6f, 0.899928, 0.900 },
    { 0xc0, 0x00, 0x70, 0.919633, 0.920 },
    { 0xc2, 0x80, 0x70, 0.939771, 0.940 },
    { 0xc4, 0x00, 0x71, 0.960348, 0.960 },
    { 0xc6, 0x80, 0x71, 0.981378, 0.981 },
    { 0xc8, 0x00, 0x72, 1.002867, 1.003 }
};

static bool joycon_is_in_range(int val, int low, int high)
{
    return (low <= val && val <= high);
}

/*
 * @fn      joycon_rumble
 * @brief   ジョイコンを振動する
 *  振動周波数は固定(デフォルト？の320Hz,160Hz)で強さ(振幅)のみを指定する
 * @param[in] jc ジョイコン情報
 * @param[in] amp 強さ(0-100，0でoff)
 * @return  エラーコード
 */
joycon_err joycon_rumble(joyconlib_t* jc, int amp)
{
    return joycon_rumble_raw(jc, JOYCON_FREQ_HIGH_DEFAUILT, amp, JOYCON_FREQ_LOW_DEFAUILT, amp);

    // if (!jc || !joycon_is_in_range(amp, 0, 100))
    //     return JOYCON_ERR_INVALID_ARGUMENT;

    // default freq. H:0x0001 (320Hz) L:0x40 (160Hz)
    // default amp. H:0x00 L:0x40 (0.0)
    // amp [0,100] 0:off
    // jc->rumble[0] = joycon_freq_table[JOYCON_FREQ_HIGH_DEFAUILT].hf0;
    // jc->rumble[1] = joycon_freq_table[JOYCON_FREQ_HIGH_DEFAUILT].hf1 | joycon_amp_table[amp].ha1;
    // jc->rumble[2] = joycon_freq_table[JOYCON_FREQ_LOW_DEFAUILT].lf2 | joycon_amp_table[amp].la2;
    // jc->rumble[3] = joycon_amp_table[amp].la3;

    // jc->rumble[0] = ((JOYCON_FREQ_HIGH_DEFAUILT - 32) << 2) & 0xff;
    // jc->rumble[1] = (((JOYCON_FREQ_HIGH_DEFAUILT - 32) >> 6) & 0x01) | (amp << 1);
    // jc->rumble[2] = (JOYCON_FREQ_LOW_DEFAUILT & 0x7f) | (((0x80 + amp) << 7) & 0x80);
    // jc->rumble[3] = ((0x80 + amp) >> 1) & 0xff;

    // return joycon_write(jc, JOYCON_CMD_RUMBLE, 0, 0, 0, NULL);
}

/*
 * @fn      joycon_rumble_raw
 * @brief   ジョイコンを振動する
 *  高/低帯域の周波数と振幅を指定する
 *  指定値と周波数，振幅の関係は別表の通り
 * @param[in] jc ジョイコン情報
 * @param[in] hfreq 高帯域周波数(33-159)
 * @param[in] hamp 高帯域振幅(0-100)
 * @param[in] lfreq 低帯域周波数(1-127)
 * @param[in] lamp 低帯域振幅(0-100)
 * @return  エラーコード
 */
joycon_err joycon_rumble_raw(joyconlib_t* jc, int hfreq, int hamp, int lfreq, int lamp)
{
    if (!jc || !joycon_is_in_range(hfreq, 33, 159) || !joycon_is_in_range(hamp, 0, 100) || !joycon_is_in_range(lfreq, 1, 127) || !joycon_is_in_range(lamp, 0, 100))
        return JOYCON_ERR_INVALID_ARGUMENT;

    // テーブルに従った段階指定 freq. H:33-159 L:1-127 amp.:0-100
    jc->rumble[0] = ((hfreq - 32) << 2) & 0xff;
    jc->rumble[1] = (((hfreq - 32) >> 6) & 0x01) | (hamp << 1);
    jc->rumble[2] = (lfreq & 0x7f) | (((0x80 + lamp) << 7) & 0x80);
    jc->rumble[3] = ((0x80 + lamp) >> 1) & 0xff;

    return joycon_write(jc, JOYCON_CMD_RUMBLE, 0, 0, 0, NULL);
}

static joycon_err joycon_repeat_rumble(joyconlib_t* jc, int freq, int amp, int sleep, int repeat, int flg)
{
    int hf = (freq < 33) ? 33 : ((freq > 159) ? 159 : freq);
    int lf = (freq < 1) ? 1 : ((freq > 127) ? 127 : freq);
    int ha = (freq < 33) ? 0 : ((freq > 159) ? 0 : amp);
    int la = (freq < 1) ? 0 : ((freq > 127) ? 0 : amp);
    do {
        joycon_rumble_raw(jc, hf, ha, lf, la);
        usleep(sleep);
    } while (--repeat);
    // flg
    // 1: 次の音が同じ(ex: EE)
    if (flg == 1) {
        // 音の切れ目を作るために最後の無音を1回
        joycon_rumble_raw(jc, hf, 0, lf, 0);
        // usleep(sleep);
    }
    return JOYCON_ERR_NONE;
}

static u8 scale_to_freq[6][15] = {
    // [octave-1][scale-1]
    // c,c+,d,d+,e,f,f+,g,g+,a,a+,b,0,rest,0 (first_mml -1)
    { 0, 0, 0, 0, 1, 4, 7, 9, 12, 15, 17, 20, 0 },
    { 23, 25, 28, 31, 33, 36, 39, 41, 44, 47, 49, 52, 0 },
    { 55, 57, 60, 63, 65, 68, 71, 73, 76, 79, 81, 84, 0 },
    { 87, 89, 92, 95, 97, 100, 102, 105, 108, 111, 113, 116, 0 },
    { 119, 121, 124, 127, 129, 132, 135, 137, 140, 143, 145, 148, 0 },
    { 151, 153, 156, 159, 0 },
};

static u8 first_mml[64] = {
    0, 10, 12, 1, 3, 5, 6, 8, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 10, 12, 1, 3, 5, 6, 8, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
};

static inline int clamp(int value, int low, int high)
{
    return value < low ? low : (value > high ? high : value);
}

static int approximate(int l)
{
    int t[7]  = { 0, 1, 2, 4, 8, 16, 32 };
    int mt[7] = { 0, 1, 2, 6, 12, 24, 48 };
    for (int i = 0; i < 7; i++) {
        if (l <= mt[i])
            return t[i];
    }
    return 64;
}

joycon_err joycon_play_rumble(joyconlib_t* jc, char* mml, size_t sz, int (*callback)(void*), void* data)
{
    if (!jc || !mml)
        return JOYCON_ERR_INVALID_ARGUMENT;

    int flg    = 1;
    char* last = mml + sz;
    // 初期値
    int tempo    = 120;
    int sleep    = 60 * 1000 * 1000 / tempo / 16; // 64分音符の時間(us)
    int vol      = 50;
    int octave   = 4;
    int length   = 4;
    int tmplen   = 0;
    float dot    = 1.0;
    int scale    = 0;
    int repeat   = 64 / length; // 振動送信回数（1回送信ごとにsleep時間スリープ）
    char lastmml = '\0';

    while (flg && (mml < last)) {
        switch (*mml) {
        case 'V':
        case 'v':
            vol = clamp(strtol(mml + 1, &mml, 10), 0, 100);
            break;
        case 'T':
        case 't':
            tempo = clamp(strtol(mml + 1, &mml, 10), 30, 240);
            sleep = 60 * 1000 * 1000 / tempo / 16; // 64分音符の時間(us)
            break;
        case 'O':
        case 'o':
            octave = clamp((mml[1] - '0'), 1, 6);
            mml += 2;
            break;
        case '<':
            octave = clamp(octave + 1, 1, 6);
            mml++;
            break;
        case '>':
            octave = clamp(octave - 1, 1, 6);
            mml++;
            break;
        case 'L':
        case 'l':
            length = approximate(strtol(mml + 1, &mml, 10));
            break;
        default:
            lastmml = *mml;
            scale   = first_mml[*mml - 0x40];
            mml++;
            while (scale) {
                switch (*mml) {
                case '+':
                case '#':
                    scale++;
                    mml++;
                    break;
                case '-':
                    scale--;
                    mml++;
                    break;
                case '.':
                    dot = 1.5;
                    mml++;
                    break;
                default: {
                    char* m = mml;
                    int len = approximate(strtol(mml, &m, 10));
                    if (m > mml) {
                        tmplen = len;
                        mml    = m;
                    } else {
                        repeat = dot * (64 / (tmplen ? tmplen : length));
#ifdef DEBUG
                        printf("T%d V%d O%d L%d scl:%d slp:%d rep:%d\n", tempo, vol, octave, (tmplen ? tmplen : length), scale, sleep, repeat);
#endif
                        joycon_repeat_rumble(jc, scale_to_freq[octave - 1][scale - 1], vol, sleep, repeat, (lastmml == *mml));
                        tmplen = 0;
                        scale  = 0;
                        dot    = 1.0;
                    }
                } break;
                }
            }
            break;
        }
        flg = callback ? (*callback)(data) : 1;
    }
    return JOYCON_ERR_NONE;
}
